# Задача 2. Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.
# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21

'''ax = int(input("Введите координату Х точки А: "))
ay = int(input("Введите координату Y точки А: "))
bx = int(input("Введите координату Х точки B: "))
by = int(input("Введите координату Y точки B: "))
# применяем теорему Пифагора
print('Расстояние между точками А и В = ', round(((ax - bx) ** 2 + (ay - by) ** 2) ** 0.5, 2))'''
